#How to write csv file:part2

In [1]:
import pandas as pd

In [2]:
pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')

  Student_id  class  sleep_hr  math  science  marathi  hindi  total
0      S0001      7         6    60       90       78     56     67
1      S0002      5         4    90       60       67     78     76
2      S0003      6         6    70       70       56     98     56
3      S0004      9         8    50       80       34     43     89
4      S0005      3         5    50       80       89     53     76
5      S0006      6         5    60       80       76     63     49
6      S0007      2         5    60       89       56     73     78

In [3]:
pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')

            0      1         2     3        4        5      6      7
0  Student_id  class  sleep_hr  math  science  marathi  hindi  total
1       S0001      7         6    60       90       78     56     67
2       S0002      5         4    90       60       67     78     76
3       S0003      6         6    70       70       56     98     56
4       S0004      9         8    50       80       34     43     89
5       S0005      3         5    50       80       89     53     76
6       S0006      6         5    60       80       76     63     49
7       S0007      2         5    60       89       56     73     78

#We dont want header that type we need header student_id.......

In [4]:
pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',header=1)

  Student_id  class  sleep_hr  math  science  marathi  hindi  total
0      S0001      7         6    60       90       78     56     67
1      S0002      5         4    90       60       67     78     76
2      S0003      6         6    70       70       56     98     56
3      S0004      9         8    50       80       34     43     89
4      S0005      3         5    50       80       89     53     76
5      S0006      6         5    60       80       76     63     49
6      S0007      2         5    60       89       56     73     78

In [5]:
pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')

,Unnamed: 0,Unnamed: 1,Data,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,Student_id,class,sleep_hr,math,science,marathi,hindi,total
1,S0001,7,6,60,90,78,56,67
2,S0002,5,4,90,60,67,78,76
3,S0003,6,6,70,70,56,98,56
4,S0004,9,8,50,80,34,43,89
5,S0005,3,5,50,80,89,53,76
6,S0006,6,5,60,80,76,63,49
7,S0007,2,5,60,89,56,73,78

#If we dont want headre then...

In [6]:
pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',header=None)

            0      1         2     3        4        5      6      7
0         NaN    NaN      Data   NaN      NaN      NaN    NaN    NaN
1  Student_id  class  sleep_hr  math  science  marathi  hindi  total
2       S0001      7         6    60       90       78     56     67
3       S0002      5         4    90       60       67     78     76
4       S0003      6         6    70       70       56     98     56
5       S0004      9         8    50       80       34     43     89
6       S0005      3         5    50       80       89     53     76
7       S0006      6         5    60       80       76     63     49
8       S0007      2         5    60       89       56     73     78

In [8]:
pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',header=1)

  Student_id  class  sleep_hr  math  science  marathi  hindi  total
0      S0001      7         6    60       90       78     56     67
1      S0002      5         4    90       60       67     78     76
2      S0003      6         6    70       70       56     98     56
3      S0004      9         8    50       80       34     43     89
4      S0005      3         5    50       80       89     53     76
5      S0006      6         5    60       80       76     63     49
6      S0007      2         5    60       89       56     73     78

#headre and prefix

In [9]:
pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')

   S0001  7  6  60  90  78  56  67
0  S0002  5  4  90  60  67  78  76
1  S0003  6  6  70  70  56  98  56
2  S0004  9  8  50  80  34  43  89
3  S0005  3  5  50  80  89  53  76
4  S0006  6  5  60  80  76  63  49
5  S0007  2  5  60  89  56  73  78

In [10]:
pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',header=None)

       0  1  2   3   4   5   6   7
0  S0001  7  6  60  90  78  56  67
1  S0002  5  4  90  60  67  78  76
2  S0003  6  6  70  70  56  98  56
3  S0004  9  8  50  80  34  43  89
4  S0005  3  5  50  80  89  53  76
5  S0006  6  5  60  80  76  63  49
6  S0007  2  5  60  89  56  73  78

In [15]:
pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',header=None , prefix ="columns")

TypeError: read_csv() got an unexpected keyword argument 'prefix'

#To give name to each column

In [16]:
pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')

   S0001  7  6  60  90  78  56  67
0  S0002  5  4  90  60  67  78  76
1  S0003  6  6  70  70  56  98  56
2  S0004  9  8  50  80  34  43  89
3  S0005  3  5  50  80  89  53  76
4  S0006  6  5  60  80  76  63  49
5  S0007  2  5  60  89  56  73  78

In [17]:
pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',names=['A','B','C','D','E','F','G','H'])

       A  B  C   D   E   F   G   H
0  S0001  7  6  60  90  78  56  67
1  S0002  5  4  90  60  67  78  76
2  S0003  6  6  70  70  56  98  56
3  S0004  9  8  50  80  34  43  89
4  S0005  3  5  50  80  89  53  76
5  S0006  6  5  60  80  76  63  49
6  S0007  2  5  60  89  56  73  78